# Fundamentos de SQL
### Reto 1: Búsqueda de patrones mediante LIKE
Usando la base de datos tienda, escribe consultas que permitan responder las siguientes preguntas.

In [2]:
%%sql
USE tienda;

 * mysql://data-09:***@data-09.bedu.org
0 rows affected.

[]

1. ¿Qué artículos incluyen la palabra Pasta en su nombre?

In [3]:
%%sql
SELECT *
    FROM articulo
    WHERE nombre LIKE '%Pasta%';

 * mysql://data-09:***@data-09.bedu.org
17 rows affected.

[(2, 'Pasta - Angel Hair', 4391.73, 959.51, 503),
 (27, 'Pasta - Elbows, Macaroni, Dry', 3668.7, 253.66, 392),
 (70, 'Pasta - Shells, Medium, Dry', 801.74, 773.8, 206),
 (91, 'Pasta - Cheese / Spinach Bauletti', 5811.44, 619.36, 15),
 (134, 'Pasta - Orzo, Dry', 6537.91, 1113.99, 906),
 (213, 'Pasta - Rotini, Colour, Dry', 1830.13, 373.98, 309),
 (233, 'Pasta - Cannelloni, Sheets, Fresh', 2316.37, 605.55, 307),
 (327, 'Pasta - Cappellini, Dry', 6994.49, 766.18, 828),
 (361, 'Pasta - Penne, Rigate, Dry', 2222.62, 584.88, 276),
 (426, 'Pasta - Cappellini, Dry', 2417.66, 1088.42, 411),
 (431, 'Pasta - Orzo, Dry', 806.33, 495.92, 142),
 (570, 'Pasta - Penne, Lisce, Dry', 2141.06, 809.94, 88),
 (600, 'Pasta - Ravioli', 6504.48, 612.67, 15),
 (655, 'Pasta - Fettuccine, Dry', 5369.44, 314.75, 344),
 (750, 'Pasta - Bauletti, Chicken White', 1365.92, 786.09, 701),
 (855, 'Pasta - Tortellini, Fresh', 708.96, 61.74, 38),
 (994, 'Pasta - Detalini, White, Fresh', 6445.34, 737.63, 238)]

2. ¿Qué artículos incluyen la palabra Cannelloni en su nombre?

In [4]:
%%sql
SELECT * 
    FROM articulo
    WHERE nombre LIKE '%Cannelloni%';

 * mysql://data-09:***@data-09.bedu.org
1 rows affected.

[(233, 'Pasta - Cannelloni, Sheets, Fresh', 2316.37, 605.55, 307)]

3. ¿Qué nombres están separados por un guión (-) por ejemplo Puree - Kiwi?

In [5]:
%%sql 
SELECT * 
    FROM articulo
    WHERE nombre LIKE '% - %'
    LIMIT 10;

 * mysql://data-09:***@data-09.bedu.org
10 rows affected.

[(1, 'Chocolate - Feathers', 2738.93, 12.26, 144),
 (2, 'Pasta - Angel Hair', 4391.73, 959.51, 503),
 (3, 'Soup Campbells - Tomato Bisque', 2991.35, 587.59, 604),
 (4, 'Wine - Valpolicella Masi', 2625.2, 770.1, 575),
 (5, 'Mousse - Banana Chocolate', 3701.62, 893.46, 248),
 (6, 'Yeast Dry - Fleischman', 923.18, 524.08, 818),
 (7, 'Nantucket - Kiwi Berry Cktl.', 5579.47, 1012.33, 527),
 (8, 'Wine - Fontanafredda Barolo', 2684.64, 327.16, 682),
 (9, 'Lotus Rootlets - Canned', 1996.46, 324.72, 636),
 (10, 'Wine - Vovray Sec Domaine Huet', 6066.99, 890.47, 397)]

4. ¿Qué puestos incluyen la palabra Designer?

In [6]:
%%sql
SELECT * 
    FROM puesto
    WHERE nombre LIKE '%Designer%';

 * mysql://data-09:***@data-09.bedu.org
18 rows affected.

[(15, 'Web Designer IV', 24826.77),
 (21, 'Graphic Designer', 19305.16),
 (59, 'Graphic Designer', 24724.2),
 (127, 'Web Designer IV', 17833.57),
 (179, 'Graphic Designer', 16366.24),
 (309, 'Graphic Designer', 23354.79),
 (447, 'Graphic Designer', 12077.16),
 (449, 'Web Designer I', 20419.88),
 (504, 'Graphic Designer', 19845.21),
 (538, 'Web Designer II', 18487.79),
 (630, 'Web Designer III', 17926.96),
 (727, 'Web Designer IV', 15749.84),
 (818, 'Web Designer I', 24556.41),
 (839, 'Web Designer IV', 15779.85),
 (889, 'Web Designer IV', 20530.46),
 (920, 'Web Designer III', 26158.08),
 (969, 'Graphic Designer', 24139.1),
 (983, 'Graphic Designer', 15770.38)]

5. ¿Qué puestos incluyen la palabra Developer?

In [7]:
%%sql
SELECT * 
    FROM puesto
    WHERE nombre LIKE '%Developer%';

 * mysql://data-09:***@data-09.bedu.org
26 rows affected.

[(61, 'Web Developer III', 15457.03),
 (83, 'Web Developer IV', 12456.52),
 (142, 'Developer II', 13860.47),
 (147, 'Senior Developer', 27119.94),
 (222, 'Developer III', 11616.76),
 (268, 'Developer IV', 11112.31),
 (270, 'Web Developer I', 23536.3),
 (357, 'Web Developer II', 24252.13),
 (366, 'Web Developer IV', 29615.38),
 (367, 'Senior Developer', 27606.4),
 (408, 'Developer III', 28360.7),
 (509, 'Developer II', 23664.84),
 (526, 'Developer II', 12054.4),
 (550, 'Web Developer II', 19845.61),
 (564, 'Developer III', 19597.44),
 (635, 'Web Developer II', 26175.94),
 (656, 'Developer II', 13433.86),
 (667, 'Developer II', 27196.55),
 (733, 'Senior Developer', 26186.01),
 (832, 'Senior Developer', 29130.04),
 (834, 'Senior Developer', 10026.46),
 (845, 'Senior Developer', 24442.15),
 (919, 'Developer IV', 15157.46),
 (952, 'Developer IV', 15620.98),
 (995, 'Developer III', 19229.64),
 (997, 'Developer II', 10405.99)]

### Reto 2: Funciones de agrupamiento
Usando la base de datos tienda, escribe consultas que permitan responder las siguientes preguntas.

1. ¿Cuál es el promedio de salario de los puestos?

In [8]:
%%sql
SELECT avg(salario) 'Promedio Salario'
    FROM puesto;

 * mysql://data-09:***@data-09.bedu.org
1 rows affected.

[(19595.051179999973,)]

2. ¿Cuántos artículos incluyen la palabra Pasta en su nombre?

In [9]:
%%sql
SELECT count(*) Pasta
    FROM articulo
    WHERE nombre LIKE '%Pasta%';

 * mysql://data-09:***@data-09.bedu.org
1 rows affected.

[(17,)]

3. ¿Cuál es el salario mínimo y máximo?

In [10]:
%%sql
SELECT min(salario) 'Salario Minimo', max(salario) 'Salario Maximo'
    FROM puesto;

 * mysql://data-09:***@data-09.bedu.org
1 rows affected.

[(10013.44, 29996.58)]

4. ¿Cuál es la suma del salario de los últimos cinco puestos agregados?

In [11]:
%%sql
SELECT SUM(salario) 'Suma salarios ultimos 5 puestos'
    FROM (SELECT * FROM puesto ORDER BY id_puesto DESC LIMIT 5) as puestos;

 * mysql://data-09:***@data-09.bedu.org
1 rows affected.

[(79690.05,)]

### Reto 3: Agrupamientos
Usando la base de datos tienda, escribe consultas que permitan responder las siguientes preguntas.

1. ¿Cuántos registros hay por cada uno de los puestos?

In [12]:
%%sql
SELECT nombre puesto, COUNT(nombre) registros
    FROM puesto
    GROUP BY nombre
    LIMIT 10;

 * mysql://data-09:***@data-09.bedu.org
10 rows affected.

[('Analog Circuit Design manager', 8),
 ('Junior Executive', 8),
 ('Director of Sales', 8),
 ('Staff Scientist', 9),
 ('Desktop Support Technician', 5),
 ('Budget/Accounting Analyst III', 4),
 ('Accounting Assistant III', 3),
 ('Programmer Analyst II', 2),
 ('Nurse Practicioner', 16),
 ('Social Worker', 10)]

2. ¿Cuánto dinero se paga en total por puesto?

In [13]:
%%sql
SELECT nombre puesto, sum(salario) pago
    FROM puesto
    GROUP BY nombre
    LIMIT 10;

 * mysql://data-09:***@data-09.bedu.org
10 rows affected.

[('Analog Circuit Design manager', 179310.18000000002),
 ('Junior Executive', 156846.26),
 ('Director of Sales', 136630.69),
 ('Staff Scientist', 157528.98),
 ('Desktop Support Technician', 92315.22),
 ('Budget/Accounting Analyst III', 70107.77),
 ('Accounting Assistant III', 78947.08),
 ('Programmer Analyst II', 35658.78),
 ('Nurse Practicioner', 296384.04),
 ('Social Worker', 168107.81)]

3. ¿Cuál es el número total de ventas por vendedor?

In [14]:
%%sql
Select id_empleado empleado, count(id_empleado) ventas
    FROM venta
    GROUP BY id_empleado
    #ORDER BY ventas DESC
    LIMIT 10;

 * mysql://data-09:***@data-09.bedu.org
10 rows affected.

[(2, 2),
 (3, 2),
 (4, 1),
 (5, 1),
 (6, 2),
 (12, 5),
 (15, 4),
 (18, 2),
 (22, 1),
 (23, 2)]

4. ¿Cuál es el número total de ventas por artículo?

In [15]:
%%sql
Select id_articulo articulo, count(id_articulo) ventas
    FROM venta
    GROUP BY id_articulo
    #ORDER BY ventas DESC
    LIMIT 10;

 * mysql://data-09:***@data-09.bedu.org
10 rows affected.

[(2, 1),
 (3, 1),
 (4, 2),
 (8, 1),
 (10, 1),
 (11, 1),
 (12, 1),
 (13, 2),
 (15, 1),
 (18, 1)]